In [82]:
import numpy as np
from scipy.stats import *
import pandas as pd
import math
import matplotlib.pyplot as plt
import seaborn as sns

%precision 3
%matplotlib inline

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

# 한글 설정
# plt.rcParams["font.family"]='gulim'
# plt.rcParams["font.size"] = 12

'%.3f'

In [83]:
# 1) 사용자 함수를 만들어 보자
def user_function01_sum(x,y):
    result = x + y
    return result

In [84]:
user_function01_sum(pd.Series([2,4,6]),4)

0     6
1     8
2    10
dtype: int64

In [85]:
# 2) 객체 간 리턴형 메소드를 호출해서 연산하는 구조를 만들어 보자
def user_fun02_sum(x,y):
    result = x.sum()+y
    return result

In [86]:
user_fun02_sum(pd.Series([2,4,6]),4)

16

In [87]:
# 3) 라이브러리가 가지고 있는 내장함수를 이용해서 사용자 함수를 만들어 보기
def udf_mean01(x):
    result = round(x.mean(), 3) # 매개인자로 사용자 값을 받아서 내장함수를 통해 연산
    return result

In [88]:
udf_mean01(pd.Series([2, 4, 6, 1.2, 4.5, 10, 0.05]))

3.964

In [89]:
# 4 라이브러리가 가지고 있는 내장함수를 이용해서 사용자 함수를 만들어 보기 자리수 지정
def udf_mean01(x, digit=5):
    result = round(x.mean(), digit) # 매개인자로 사용자 값을 받아서 내장함수를 통해 연산
    return result

In [90]:
udf_mean01(pd.Series([2, 4, 6, 1.2, 4.5, 10, 0.05]))

3.964

In [91]:
# 5 입력 객체의 원소를 모두 곱한 후 그 원소를 더한 다음 제곱근을 취하는 사용자 정의 함수를 만들기
# [3,5,9,20] 출력값 udf_01
def udf_01(x):
    result = np.sqrt(x.prod()+x)
    return result

def udf_011(x):
    result = np.sqrt(x.sum())
    return result

def udf_012(x):
    temp = [i*i for i in x]
    result = np.sqrt(sum(temp))
    return result

def udf_013(x):
    result = x.pow(2).sum()**0.5
    return result 

def udf_014(x):
    result = (x**2).sum()**0.5
    return result

In [92]:
udf_01(pd.Series([3,5,9,20]))
udf_011(pd.Series([3,5,9,20]))
udf_012(pd.Series([3,5,9,20]))
udf_013(pd.Series([3,5,9,20]))
udf_014(pd.Series([3,5,9,20]))

0    51.990384
1    52.009614
2    52.048055
3    52.153619
dtype: float64

6.083

22.694

22.694

22.694

In [93]:
# 6 입력 객체의 원소를 모두 제곱한 후 그 원소를 더한 다음 제곱근을 취하는 사용자 정의 함수를 만들기
# [3,5,9,20] 출력값 udf_02
def udf_02(x):
    result = np.sqrt(x^2+x)
    return result

In [94]:
udf_02(pd.Series([3,5,9,20]))

0    2.449490
1    1.414214
2    1.414214
3    1.414214
dtype: float64

In [95]:
# 7 표준화 사용자 함수를 만들고 [-4, 5 , 7, 9]을 입력한 경우 7은 얼마나 리턴되는지 확인
# udf_03
def udf_03(x):
    result = (x-x.mean())/x.std()
    return result

In [96]:
udf_03(pd.Series([-4, 5, 7, 9]))

0   -1.437957
1    0.130723
2    0.479319
3    0.827915
dtype: float64

In [97]:
# 8  MinMax 정규화 사용자 함수를 만들고 [-4, 5 , 7, 9]을 입력한 경우 7은 얼마나 리턴되는지 확인
# udf_04
def udf_04(x):
    result = (x-x.min())/(x.max() -x.min())
    return result

In [98]:
udf_04(pd.Series([-4, 5, 7, 9]))

0    0.000000
1    0.692308
2    0.846154
3    1.000000
dtype: float64

pd.Series -> sum(), min(), max(), mean(), std(), skew()_왜도, kurt()_첨도,  
unique()*고유값, idxmax() _ 최대값의 위치 , isin([1,2])* 포함 유무 검사  
- pd.DataFrame -> 중복된 연산 및 crosstab() _ 두변수를 조합하여 살펴 볼때 사용  
    normalize=True일 경우 1,0 값을 할당 후 정규화 할수 있다.  

https://www.kaggle.com/competitions/bike-sharing-demand/data  
datetime - hourly date + timestamp (자전거 대여 시간대)  
season - 1 = spring, 2 = summer, 3 = fall, 4 = winter  
holiday - whether the day is considered a holiday (공휴일)  
workingday - whether the day is neither a weekend nor holiday (주말 공휴일제외 나머지)  
weather - 1: Clear, Few clouds, Partly cloudy, Partly cloudy (맑음)  
2: Mist + Cloudy, Mist + Broken clouds, Mist + Few clouds, Mist (구름약간, 안개)  
3: Light Snow, Light Rain + Thunderstorm + Scattered clouds, Light Rain + Scattered clouds (비)  
4: Heavy Rain + Ice Pallets + Thunderstorm + Mist, Snow + Fog (악천후)  
temp - temperature in Celsius (섭씨 기온)  
atemp - "feels like" temperature in Celsius (체감 온도)  
humidity - relative humidity (상대적 습도)  
windspeed - wind speed (풍속)  
casual - number of non-registered user rentals initiated (일일권 자전거 대여수)  
registered - number of registered user rentals initiated (정기권 이용자 자전거 대여수)  
count - number of total rentals

### 표본 추출
 - Sysyematic sampling(계통 추출) : 첫 표본을 무작위로 추출 간격(K)만큼 떨어진 곳에 데이터 추출
 - Cluster sampling (군집 추출)   : 소수의 군집으로 분할하고 일정 수의 소집단을 임의 추출한다
 - pandas -sample() : 단순 추출, n_표본개수, frac는 비율, random_state는 seed 
          -groupby()
 
 - sklearn - train_test_split() : 입력 프레임 데이터를 배열의 두 세트 (학습, 평가)로 나눈다
             train_size, test_size = 개수, 비율을 입력하게 되면 표본 개수 조절

In [101]:
# 9) 데이터 로드 bike.csv 로드해서 상위 5개 출력
df = pd.read_csv('../../ML_DATA/bike.csv')
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [106]:
# 10) bike 데이터의 1.23% 추출한 행은 몇 개 인가 _sample()
res = df.sample(frac = 0.0123, random_state=7)
res.shape #134개

(134, 12)

In [118]:
# 11) season 기준 5% 추출
res01 = df['season'].sample(frac = 0.05, random_state=7)
res02 = df.groupby(by=["season"], dropna=False).sample(frac = 0.05, random_state=1, replace = True)
res01.shape
res02

(544,)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
1061,2011-03-08 18:00:00,1,0,1,1,13.94,16.665,27,12.9980,21,214,235
235,2011-01-11 02:00:00,1,0,1,2,6.56,7.575,55,12.9980,0,3,3
1096,2011-03-10 07:00:00,1,0,1,3,15.58,19.695,0,15.0013,1,36,37
905,2011-03-02 04:00:00,1,0,1,1,8.20,10.605,75,8.9981,1,0,1
960,2011-03-04 11:00:00,1,0,1,1,11.48,13.635,52,15.0013,16,73,89
...,...,...,...,...,...,...,...,...,...,...,...,...
4326,2011-10-12 07:00:00,4,0,1,2,22.14,25.760,88,26.0027,15,244,259
9867,2012-10-15 12:00:00,4,0,1,3,24.60,28.790,78,22.0028,73,211,284
10030,2012-11-03 07:00:00,4,0,0,2,13.12,15.150,49,16.9979,1,58,59
10571,2012-12-06 21:00:00,4,0,1,2,9.84,12.120,60,8.9981,7,184,191
5188,2011-12-10 06:00:00,4,0,0,1,9.84,12.880,65,7.0015,1,10,11

In [124]:
# 12) sklearn train_test_split() 을 사용해서 8:2로 분류하고 최고 온도 
from sklearn.model_selection import train_test_split
X_train, X_test = \
train_test_split(df, test_size=0.2, random_state=123)

X_train['temp'].max()
X_test['temp'].max()

41.000

39.360

In [149]:
# 13) temp와 atemp 변수 차이의 절댓값 평균
def user01 (df):
    result = abs(df['temp']-df['atemp']).mean()    
    return result 

user01(df)

3.509

In [154]:
# 14) casual(일일권 사용자 자전거 대여) 최대값이 25가 넘은 날은 총 몇일인가
df.info() # 데이터 타입 확인하면 object로 나옮 -> datetime으로 바꾸어준다
df['datetime'] = pd.to_datetime(df['datetime'])
df['date']=df['datetime'].dt.date
df.head()
df_agg=df.groupby('date')['casual'].max()
df_agg.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  datetime64[ns]
 1   season      10886 non-null  int64
 2   holiday     10886 non-null  int64
 3   workingday  10886 non-null  int64
 4   weather     10886 non-null  int64
 5   temp        10886 non-null  float64
 6   atemp       10886 non-null  float64
 7   humidity    10886 non-null  int64
 8   windspeed   10886 non-null  float64
 9   casual      10886 non-null  int64
 10  registered  10886 non-null  int64
 11  count       10886 non-null  int64
 12  date        10886 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(8), object(1)
memory usage: 1.1+ MB

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2011-01-01
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,2011-01-01
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,2011-01-01

date
2011-01-01    47
2011-01-02    20
2011-01-03    14
2011-01-04    18
2011-01-05    12
Name: casual, dtype: int64

In [158]:
# df01 = df[df['casual'] > 25]['datetime']
# df01.groupby('datetime')

In [163]:
# 14-1) 최대값이 25가 넘는 날은 몇일 -> 384일
df_agg_res = df_agg[df_agg > 25]
df_agg_res.head()
len(df_agg_res)

date
2011-01-01    47
2011-01-15    33
2011-01-16    35
2011-02-06    52
2011-02-12    47
Name: casual, dtype: int64

384

In [178]:
# 14-2) 
df_agg_res02 = df.groupby('date')['casual'].max().reset_index()
df_agg_res02.head()

         date  casual
0  2011-01-01      47
1  2011-01-02      20
2  2011-01-03      14
3  2011-01-04      18
4  2011-01-05      12

In [190]:
# 15) 시간대별 registered (정규권) 평균을 산출했을 때 가장 큰 시간은
# datetime으로 시간정보를 추출, mean()으로 시간별 평균을 구하면 된다.

# reset_index() : 기존의 index를 초기화한다 -> 0~row 개수만큼 할당
# set_index()   : 특정 변수를 인덱스로 지정할 경우 사용하는 메서드
# 데이터 병합 시계열 분해

#concat() axis =1 컬럼방향으로 병합 # 줄 또는 행으로 이어 붙이기

# merge() : 데이터 프레임을 변수기준으로 병합 = join



df['hour'] = df['datetime'].dt.hour
# df.head()
df_hour = df.groupby('hour')['registered'].mean().reset_index()
df_hour.head()

df_hour.loc[df_hour['registered']==df_hour['registered'].max(),] # 테이블로 확인
df_hour.loc[df_hour['registered'].idxmax()]
df_hour.max()

   hour  registered
0     0   44.826374
1     1   27.345815
2     2   18.080357
3     3    9.076212
4     4    5.144796

    hour  registered
17    17  393.324561

hour           17.000000
registered    393.324561
Name: 17, dtype: float64

hour           23.000000
registered    393.324561
dtype: float64

In [191]:
#16) join_data_group_menber.csv = A
# join_data_group_menber_room.csv = B

#LeftJoin을 했을 경우 생성되는 결측행의 개수

In [193]:
# 17 bike의 여름과 겨울의 시간대에 registered 평균을 비교할 때 가장 차이가 많이 나는 시각은

In [196]:
# 18) 비가 온 날에 30도가 넘는 시각의count 평균
# humidity의 최대값이 100인 날을 비가 온 날로 간주한다
# 일자별 humidity의 최대값을 산출하여 각 일자의 강우여부를 확인한다
# 해당 데이터를 기준 데이터에 join하여 정보를 추가하고
# 기온과 강우여부 두 기준으로 필터링 한 후 count()의 평균을 구한다

In [197]:
# 19) bike.csv 파일에서 workingday가 아니면서 holiday가 아닌 날의 비율은
# crosstab()

In [ ]:
# 20 ) diamonds.csv 가장 많은 데이터가 있는 세공 수준과 색상조합을 순서대로 출력하면 
# Ideal, G
#[조건] 세공 수준이 있는 cut 변수와 색상이 color 변수를 각각 crosstab()로 지정 후 melt()함수사용
# pandas - melt() _ wide form 데이터 프레임을 long form 자료 구조로 변환하는 메소드 
# id_vars 인자에 기준이 되는 변수를 지정한다

In [195]:
df

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16,2011-01-01,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40,2011-01-01,1
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32,2011-01-01,2
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13,2011-01-01,3
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1,2011-01-01,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336,2012-12-19,19
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241,2012-12-19,20
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168,2012-12-19,21
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129,2012-12-19,22
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88,2012-12-19,23

#